Repository: Szpadel/calise
Catalog: po/*.po
Languages: it

source: Using "%s" profile
it: In uso il profilo "%s"

source: Camera
it: Videocamera

source: Sysfs backlight path
it: Percorso sysfs

source: Backlight steps
it: Passi di retroilluminazione

source: Delta and offset
it: Delta e offset

source: Time gap
it: Frequenza

source: Number of values to average
it: Numero di valori da mediare

source: Calculates ambient brightness and suggests (or sets) the screen's correct backlight using a webcam. For usage instructions type "%(prog)s --help".
it: Calcola la luminosità ambientale e imposta il livello corretto di retroilluminazione dello schermo, usando una videocamera. Per istruzioni sull'utilizzo digitare "%(prog)s --help".

source: displays current version and exits
it: mostra la versione corrente ed esce

source: verbose output
it: output dettagliato

source: launches the calibration
it: avvia la calibrazione

source: cam to be used as capture device
it: videocamera da usare come dispositivo di cattura

source: sleep time between framecaptures, in seconds
it: tempo di attesa fra catture, in secondi

source: equation's delta
it: delta dell'equazione

source: offset of the 0%% value of ambient brightness
it: offset del valore 0%% della luminosità ambientale

source: number of elements to average before changing backlight
it: numero di elementi da mediare prima di cambiare livello di retroilluminazione

source: number of backlight level steps (default: 10)
it: numero di passi di retroilluminazione (default: 10)

source: choose if you have the backlight scale inverted (eg. 9 min - 0 max)
it: da abilitare se si ha la scala della retroilluminazione invertita (es. 9 min - 0 max)

source: set if your backlight steps start from an arbitrary number (eg. 2 min - 12 max instead of 0 min - 9 max)
it: impostare se il conteggio dei passi di retroilluminazione parte da un numero arbitrario (es. 2 min - 12 max invece che 0 min - 9 max)

source: disable automatic backlight level change
it: disabilita il cambiamento automatico del livello di retroilluminazione

source: turns off screen's ambient brightness correction
it: disabilita la correzione del valore ambientale con quello ottenuto da catture a schermo

source: uses the specified profile
it: usa il profilo specificato

source: location of the brightness backlight file
it: posizione del file brightness della retroilluminazione

source: logdata save path (eg. /tmp/calise.csv)
it: percorso di salvataggio per logdata (es. /tmp/calise.csv)

source: Disables the graphical user interface
it: Disabilita l'interfaccia grafica

source: This (%d) should be the minimum backlight step possible on this machine.
it: Il passo di retroilluminazione corrente (%d) dovrebbe essere il minimo possibile su questa macchina.

source: Are you able to see this message?
it: Riesci a vedere questo messaggio?

source: yes
it: sì

source: y
it: s

source: Y
it: S

source: Please respond with 'yes' or 'no' ('y' or 'n')
it: Prego rispondere con 'sì' o 'no' ('s' o 'n')

source: This passage gets a valid profile name to be stored as config file's filename.
it: Il passaggio ottione un nome valido per il profilo che verrà usato come nome del file di configurazione salvato

source: profile name: %s
it: nome del profilo: %s

source: profile path: %s
it: percorso del profilo: %s

source: This passage lists all available sysfs backlight directories and, if more than one, asks wich has to be used.
it: Questo passaggio elenca tutte le directory sysfs per il controllo della retroilluminazione disponibili e, se più d'una, chiede quale usare.

source: sysfs backlight path: %s
it: percorso sysfs: %s

source: This passage obtains available backlight steps with selected sysfs backlight path and displays them ordered from lower to higher backlight level.
it: Questo passaggio ottiene i passi di retroilluminazione disponibili con il percorso sysfs selezionato e li mostra dal meno intenso al più intenso.

source: backlight steps: %s
it: passi di retroilluminazione: %s

source: This passage asks for latitude and longitude; these are really useful for service execution since it has a lot of spatio-temporal optimizations (to reduce power and cpu usage), based on them (thanks to the great "ephem" module).
it: Questo passaggio chiede latitudine e longitudine; queste sono molto utili per l'esecuzione del servizio poiché ha molte ottimizzazioni spazio-temporali (al fine di ridurre consumo energetico e di cpu), che si basano sulla posizione geografica (grazie al fantastico modulo "ephem").

source: Latitude, Longitude: %s, %s
it: Latitudine, Longitudine: %s, %s

source: This passage lists all available cameras on this machine and, if more than one, asks wich camera has to be used.
it: Questo passaggio elenca tutte le videocamere disponibili nella macchina e, se più di una, chiede quale deve essere usata.

source: camera: %s
it: videocamera: %s

source: This passage lets the program be aware of the lower lightness that can be registered by the camera to contrast its white balance feature.
it: Questo passaggio fa si che il programma venga a conoscenza della minimo livello di luminosità che la videocamera registra, per contrastarne la caratteristica di bilanciamento del bianco

source: Average camera offset: %.1f
it: Offset videocamera medio: %.1f

source: This passage starts an interactive "capture" session where you'll be asked to select the best backlight step for that very moment. And of course "the more the brightness, the more the precision".
it: Questo passaggio avvia una sessione di "cattura" interattiva dove verrà chiesto di scegliere il miglior step di retroilluminazione per quel dato momento. Ovviamente "a maggiore luminosità ambientale segue maggiore precisione"

source: percentage: %.2f%% and backlight step: %d for current ambient brightness.
it: percentuale: %2f%% e passo di retroilluminazione: %d per la luminosità ambientale corrente

source: Conversion scale delta: %.3f
it: Delta di conversione della scala: %.3f

source: Enter a name for the new profile
it: Inserisci un nome per il nuovo profilo

source: Please retry and enter a valid name.
it: Prego riprovare ed inserire un nome valido.

source: Since it'll be a filename, chars not supported by your os will raise an error
it: Poiché sarà il nome di un file, caratteri non supportati dal tuo os genereranno un errore

source: Selected profile already exists, overwrite?
it: Il profilo scelto esiste già, sovreascrivere?

source: Profile already exists, overwrite?
it: Il profilo esiste già, sovreascrivere?

source: Your system does not appear to have controllable backlight
it: Sembrerebbe che il sistema non abbia interfacce per controllare la retroilluminazione

source: NOTE: To be sure you pick the right one, try to change manually the backlight level and check with a simple cat command (eg. "cat %s") wich one of the path displayed changes its value when changing backlight level.
it: NOTA: Per essere sicuri di scegliere quello corretto, provare a cambiare manualmente il livello di retroilluminazione e controllare con un semplice comando cat (es. "cat %s") quale dei percorsi mostrati cambia il suo valore al cambiare della retroilluminazione.

source: Please retry and enter an integer in the valid range 1-%d!
it: Prego riprovare ed inserisci un intero nell'intervallo 1-%d!

source: Please retry and enter an integer!
it: Prego riprovare ed inserire un intero!

source: The program will now try to semi-automatically find the minimum backlight level (before "power-off") for this machine.
it: Il programma proverà ora a trovare semi-automaticamente il livello minimo di retroilluminazione (prima del "power-off") di questa macchina.

source: NOTE: If you'll get a blank screen don't worry and just wait the default timeout (20 seconds)
it: NOTA: Se lo schermo si spegne non ci si deve preoccupare, basta aspettare il timeout predefinito (20 secondi)

source: Hit ENTER or RETURN when ready
it: Premere ENTER o RETURN quando si è pronti

source: Auto-get minimum backlight step somehow failed, trying to obtain the hard-way, set the backlight to minimum then hit RETURN or ENTER
it: L'auto-ottenimento del minimo passo di retroilluminazione è per qualche ragione fallito, passiamo alla maniera più diretta; impostare la retroilluminazione al minimo e poi premere RETURN o ENTER

source: The program has found these coordinates (%s, %s) through geoip lookup, would you like to use these value?
it: Il programma ha ottenuto queste coordinate (%s, %s) dalla ricerca geoip, usare questi valori?

source: The program has found these coordinates (%s, %s) in an existing profile, would you like to use these values also for that one?
it: Il programma ha trovato queste coordinate (%s, %s) in uno dei profili esistenti, usare questi valori anche per il profilo corrente?

source: If you don't know where to find latitude/longitude, http://www.earthtools.org/ is a good place to start from.
it: Se non si sa dove recuperare latitudine e longitudine, http://www.earthtools.org/ è un buon posto dove cominciare.

source: NOTE: N and E values have [+], S and W have instead [-].
it: NOTA: valori N ed E hanno [+] e, contrariamente, S e W hanno [-].

source: Please enter your latitude and longitude as comma separated float degrees (take a look a the examples above), if not interested in this feature just leave blank:
it: Prego inserire latitudine e longitudine come angoli decimali separati da una virgola (riferirsi agli esempi sopra), se non interessati alla caratteristica lasciare semplicemente vuoto:

source: Either latitude or longitude values are wrong, please check and retry.
it: I valori di latitudine e/o longitudine non sono cooretti, prego riprovare.

source: Choose one of cams listed above (None=%s):
it: Scegli una delle videocamere elencate sopra (Nulla=%s):

source: Cover the webcam and then press ENTER or RETURN
it: Copri la videocamera e premi ENTER o RETURN

source: Now calibrating
it: Calibrazione in corso

source: do not uncover the webcam
it: non scoprire la videocamera

source: Remove any obstruction from the camera and press ENTER or RETURN when ready to start
it: Rimuovere qualsiasi ostruzione dalla videocamera e premere ENTER o RETURN quando si è pronti per cominciare

source: Capture thread started.
it: Thread di cattura avviato.

source: Choose a value for the current ambient brightness, consider that the more brightness there is, the more precise will the scale of the program be, supported values are backlight steps or percentage (eg. %d or %d%%, percentage *can* be over 100%% for particular needs):
it: Sceglere ora un valore per la luminosità ambientale corrente, considerare che più luminosità c'è, più la scala sarà precisa; valori supportati sono passi di retroilluminazione e valori percentuali (es. %d o %d%%, le percentuali *possono* essere superiori a 100%% per esigenze particolari):

source: Choosen percentage value roughly equals to the %dth backlight step, would you like to use that value?
it: La percentuale scelta equivale grossomodo al %d° passo di retroilluminazione, desideri mantenere questo valore?

source: Choosen backlight step value roughly equals to %.2f%% of ambient brightness, would you like to use that value?
it: Il passo di retroilluminazione scelto equivale grossomodo al %d%% di luminosità ambientale, desideri mantenere questo valore?

source: Please retry and enter a value according to the rules above
it: Per favore riprovare ed inserire un valore secondo le direttive di cui sopra

source: Building a config file with the choosen settings...
it: Creazione di un file di configurazione con le impostazioni scelte...

source: config file saved as: %s
it: file di configurazione salvato come: %s

source: This profile will always be read before any other user profile and user profiles read after it will (eventually) overwrite its settings. On the other hand, root user will *only* read that file.
it: Questo profilo verrà sempre letto prima di ogni altro e il profilo dell'utente (eventualmente) ne sovrascriverà le impostazioni. D'altro canto, il programma lanciato da root leggerà *solo* questo file.

source: To use the new profile add "--profile %s" to the switches
it: Per usare il nuovo profilo aggiungere "--profile %s" alle opzioni cli

source: You may want to use this profile as system-wide one; to achieve that copy "%s" to "%s"
it: Si potrebbe voler usare questo profilo come profilo di systema; per ottenere ciò copiare "%s" su "%s"

source: Pause execution and unload the camera
it: Mette in pausa l'esecuzione e rende disponibile la videocamera

source: Start/Stop recording session each session is appended to previous one
it: Avvia/Termina la registrazione ogni sessione viene aggiunta alla precedente

source: Export recorded data
it: Esporta le informazioni registrate

source: Display detailed informations
it: Mostra informazioni dettagliate

source: Interactive backlight scale click to pause execution and set backlight step corresponding to click position
it: Scala di retroilluminazione interattiva clicca per mettere in pausa l'esecuzione ed impostare la retroilluminazione al livello corrispondente

source: About Calise
it: Informazioni su Calise

source: About Qt
it: Informazioni su Qt

source: Exit
it: Esci

source: TrayIcon
it: Icona nel vassoio

source: Close to tray
it: Chiudi nel vassoio

source: Default
it: Predefinito

source: Extended
it: Esteso

source: Full
it: Completo

source: Main menu
it: Menu principale

source: Show window
it: Mostra finestra

source: About
it: Informazioni

source: &View
it: &Visualizza

source: &Help
it: &Aiuto

source: Camera active
it: Videocamera attiva

source: Camera inactive
it: Videocamera inattiva

source: About %s
it: Informazioni su %s

source: <h3><b>Calise %s</b></h3><br />Calise (acronym for Camera Light Sensor) takes frames from a camera, calculates ambient brightness and sets screen's correct backlight level according to a user-specified scale (obtained through automatic calibration.<br /><br />Copyright &#169; 2011-2012 Nicol&ograve; Barbon<br /><br /><a href="http://sourceforge.net/projects/calise/">http://sourceforge.net/projects/calise/</a><br /><br />Calise is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, either version 3 of the License, or any later version.<br />You should have received a copy of the GNU General Public License along with Calise.<br />If not, see <a href="http://www.gnu.org/licenses/">http://www.gnu.org/licenses/</a>.<br /><br /><b>Thanks to:</b><br /> - P&#225;draig Brady for his brief guide to gettext translation<br /> - Trent Mick for query_yes_no() function<br /> - Danny Yoo for _Getch* classes<br /> - <a href="http://zetcode.com/">ZetCode</a> for the great tutorials<br/> - The GNOME team for the scheme of the big icon (from cheese)
it: <h3><b>Calise %s</b></h3><br />Calise (acronimo di Camera Light Sensor) ottiene fotogrammi da una videocamera, da questi calcola la luminosità ambientale e imposta la retroilluminazione dello schermo secondo una scala scelta dall'utente (ottenuta attraverso una calibrazione automatica).<br /><br />Copyright &#169; 2011 Nicol&ograve; Barbon<br /><br /><a href="http://sourceforge.net/projects/calise/">http://sourceforge.net/projects/calise/</a><br /><br />Calise is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, either version 3 of the License, or any later version.<br />You should have received a copy of the GNU General Public License along with Calise.<br />If not, see <a href="http://www.gnu.org/licenses/">http://www.gnu.org/licenses/</a>.<br /><br /><b>Ringraziamenti:</b><br /> - P&#225;draig Brady per la sua breve guida alla traduzione con gettext<br /> - Trent Mick per la funzione query_yes_no()<br /> - Danny Yoo per le classi _Getch*<br /> - <a href="http://zetcode.com/">ZetCode</a> per i fantastici tutorial<br/> - Il team GNOME per lo schema dell'icona grande (da cheese)

source: None
it: Nessuno
